andrjus/omega-avatar-rev.1/content/app/central/projects/waveshare-stm32407/FATFS/Target/user_diskio.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
  * @file    user_diskio.c
  * @brief   This file includes a diskio driver skeleton to be completed by the user.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                             www.st.com/SLA0044
  *
  ******************************************************************************
  */
 /* USER CODE END Header */

#ifdef USE_OBSOLETE_USER_CODE_SECTION_0
/*
 * Warning: the user section 0 is no more in use (starting from CubeMx version 4.16.0)
 * To be suppressed in the future.
 * Kept to ensure backward compatibility with previous CubeMx versions when
 * migrating projects.
 * User code previously added there should be copied in the new user sections before
 * the section contents can be deleted.
 */
/* USER CODE BEGIN 0 */
/* USER CODE END 0 */
#endif

/* USER CODE BEGIN DECL */

/* Includes ------------------------------------------------------------------*/
#include <string.h>
#include "ff_gen_drv.h"
#include <string.h>
#include "fsmc.h"
#include "stm32_bsp_nand.h"
/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/

/* Private variables ---------------------------------------------------------*/
/* Disk status */
static volatile DSTATUS Stat = STA_NOINIT;
static NAND_IDTypeDef NAND_ID;

/* USER CODE END DECL */

/* Private function prototypes -----------------------------------------------*/
DSTATUS USER_initialize (BYTE pdrv);
DSTATUS USER_status (BYTE pdrv);
DRESULT USER_read (BYTE pdrv, BYTE *buff, DWORD sector, UINT count);
#if _USE_WRITE == 1
  DRESULT USER_write (BYTE pdrv, const BYTE *buff, DWORD sector, UINT count);
#endif /* _USE_WRITE == 1 */
#if _USE_IOCTL == 1
  DRESULT USER_ioctl (BYTE pdrv, BYTE cmd, void *buff);
#endif /* _USE_IOCTL == 1 */

Diskio_drvTypeDef  USER_Driver =
{
  USER_initialize,
  USER_status,
  USER_read,
#if  _USE_WRITE
  USER_write,
#endif  /* _USE_WRITE == 1 */
#if  _USE_IOCTL == 1
  USER_ioctl,
#endif /* _USE_IOCTL == 1 */
};

/* Private functions ---------------------------------------------------------*/

/**
  * @brief  Initializes a Drive
  * @param  pdrv: Physical drive number (0..)
  * @retval DSTATUS: Operation status
  */
DSTATUS USER_initialize (
	BYTE pdrv           /* Physical drive nmuber to identify the drive */
)
{
  /* USER CODE BEGIN INIT */
	  if( HAL_NAND_Read_ID(&hnand1, &NAND_ID) == HAL_OK ) {
			Stat = RES_OK;
			return Stat;
		} else {
			Stat = RES_NOTRDY;
			return Stat;
		}
  /* USER CODE END INIT */
}

/**
  * @brief  Gets Disk Status
  * @param  pdrv: Physical drive number (0..)
  * @retval DSTATUS: Operation status
  */
DSTATUS USER_status (
	BYTE pdrv       /* Physical drive number to identify the drive */
)
{
  /* USER CODE BEGIN STATUS */
    Stat = RES_OK;
    return Stat;
  /* USER CODE END STATUS */
}

/**
  * @brief  Reads Sector(s)
  * @param  pdrv: Physical drive number (0..)
  * @param  *buff: Data buffer to store read data
  * @param  sector: Sector address (LBA)
  * @param  count: Number of sectors to read (1..128)
  * @retval DRESULT: Operation result
  */
DRESULT USER_read (
	BYTE pdrv,      /* Physical drive nmuber to identify the drive */
	BYTE *buff,     /* Data buffer to store read data */
	DWORD sector,   /* Sector address in LBA */
	UINT count      /* Number of sectors to read */
)
{
  /* USER CODE BEGIN READ */
		NAND_AddressTypeDef NAND_Address;
	  NAND_Address.Plane = 0;
		NAND_Address.Block = sector;
		NAND_Address.Page = 1;
		return BSP_NAND_Read_Page(&hnand1, &NAND_Address, (uint8_t *)buff, count) == HAL_OK? RES_OK : RES_ERROR;
  /* USER CODE END READ */
}

/**
  * @brief  Writes Sector(s)
  * @param  pdrv: Physical drive number (0..)
  * @param  *buff: Data to be written
  * @param  sector: Sector address (LBA)
  * @param  count: Number of sectors to write (1..128)
  * @retval DRESULT: Operation result
  */
#if _USE_WRITE == 1
DRESULT USER_write (
	BYTE pdrv,          /* Physical drive nmuber to identify the drive */
	const BYTE *buff,   /* Data to be written */
	DWORD sector,       /* Sector address in LBA */
	UINT count          /* Number of sectors to write */
)
{
  /* USER CODE BEGIN WRITE */
  /* USER CODE HERE */
	int n;
		NAND_AddressTypeDef NAND_Address;
	  NAND_Address.Plane = 0;
		NAND_Address.Block = sector;
		NAND_Address.Page = 1;
		
		static uint8_t buf2[2048]={5,5,5};
		
		BSP_NAND_Erase_Block(&hnand1, &NAND_Address);		
		BSP_NAND_Write_Page(&hnand1, &NAND_Address, (uint8_t *)buff, count);// == HAL_OK? RES_OK : RES_ERROR;
		BSP_NAND_Read_Page(&hnand1, &NAND_Address, (uint8_t *)buf2, 1);
		
		for( n=0;n<2048;n++ ){
			if( buff[n] != buf2[n] ){
				return RES_ERROR;
			}
		}
	
	return RES_OK;
  /* USER CODE END WRITE */
}
#endif /* _USE_WRITE == 1 */

/**
  * @brief  I/O control operation
  * @param  pdrv: Physical drive number (0..)
  * @param  cmd: Control code
  * @param  *buff: Buffer to send/receive control data
  * @retval DRESULT: Operation result
  */
#if _USE_IOCTL == 1
DRESULT USER_ioctl (
	BYTE pdrv,      /* Physical drive nmuber (0..) */
	BYTE cmd,       /* Control code */
	void *buff      /* Buffer to send/receive control data */
)
{
  /* USER CODE BEGIN IOCTL */
	DRESULT res = RES_ERROR;
	switch (cmd){
		case GET_BLOCK_SIZE:/* Get erase block size (needed at _USE_MKFS == 1) */
			*(uint32_t *)buff = 0x040;
			res= RES_OK;
			break;
		case GET_SECTOR_COUNT: /* Get media size (needed at _USE_MKFS == 1) */
			*(uint32_t *)buff = 0x10000;
			res= RES_OK;
			break;
		case CTRL_SYNC:		 /* Complete pending write process (needed at _FS_READONLY == 0) */
			if (HAL_NAND_Read_Status(&hnand1) == NAND_READY) res = RES_OK;
			break;
		/* Generic command (Used by FatFs) */
		case GET_SECTOR_SIZE:/* Get sector size (needed at _MAX_SS != _MIN_SS) */
		case CTRL_TRIM:/* Inform device that the data on the block of sectors is no longer used (needed at _USE_TRIM == 1) */

/* Generic command (Not used by FatFs) */
		case CTRL_POWER:/* Get/Set power status */
		case CTRL_LOCK:/* Lock/Unlock media removal */
		case CTRL_EJECT:/* Eject media */
		case CTRL_FORMAT:/* Create physical format on the media */

/* MMC/SDC specific ioctl command */
		case MMC_GET_TYPE: /* Get card type */
		case MMC_GET_CSD:/* Get CSD */
		case MMC_GET_CID:/* Get CID */
		case MMC_GET_OCR:/* Get OCR */
		case MMC_GET_SDSTAT:/* Get SD status */

/* ATA/CF specific ioctl command */
		case ATA_GET_REV: /* Get F/W revision */
		case ATA_GET_MODEL: /* Get model name */
		case ATA_GET_SN: /* Get serial number */
			break;
	}    
  return res;
  /* USER CODE END IOCTL */
}
#endif /* _USE_IOCTL == 1 */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
